import ProgramCard from '../../components/program/ProgramCard';

const programs = [
  {
    id: 1,
    img: '/imgs/program/program_1.svg',
    title: 'برنامج تحدي  الرواد',
    description:
      'تهدف برامجنا بالتعريف بمفهوم ريادة الاعمال وتسليط الضوء على المبدعين من أصحاب الأفكار الريادية والابداعية وتعزيز ثقافة الريادة بين أفراد المجتمع ',
  },
  {
    id: 2,
    img: '/imgs/program/program_2.svg',
    title: 'برنامج بودكاست المرشد',
    description:
      'بودكاست ارشادي لرواد الاعمال يتناول مواضيع تهم رائد الاعمال تصمم حلقات البودكاست حول هدف ان يخرج منها رائد الاعمال بخطة عمل قابلة للتنفيذ مباشرةً. يتم اعداد المحتوى بعد بحث طويل ومتعمق في موضوع محدد لتقديم افضل الممارسات واحدث التجارب واشمل الخبرات بأسلوب مبسط وسهل الفهم وسريع يتناسب مع رتم الحياة',
  },
  {
    id: 3,
    img: '/imgs/program/program_3.svg',
    title: 'برنامج بناء',
    description:
      'يهدف المشروع إلى تفعيل دور كافة أذرع المؤسسة التعليمية في المملكة ضمن منظومة ريادة الاعمال من خلال زيادة الوعي بضرورة العمل الريادي وتفعيل البحث العلمي والتدريب التقني والمهني لتطوير منتجات وخدمات الشركات الريادية واكتشاف واستقطاب وتدريب الطلبة أصحاب الأبحاث النوعية والأفكار الريادية.',
  },
  {
    id: 4,
    img: '/imgs/program/program_4.svg',
    title: 'برنامج جسور',
    description:
      'يهدف مشروع جسور إلى مد جسور التعاون المشترك بين الجهات ذات العلاقة في تطوير البنى التحتية و زيادة مشاركة دور الصناديق الاستثمارية وأصحاب رؤوس الأموال والتمويل الخيري في نمو شركات  رواد الأعمال الناشئة وضمان استدامتها بالإضافة إلى تشجيع وتحفيز أصحاب الأفكار الإبداعية من دخول السوق وبدء أعمالهم التجارية .',
  },
];

const Program = () => (
  <section className="section program">
    <ul className="program__list">
      {programs.map((program) => (
        <ProgramCard key={program.id} {...program} />
      ))}
    </ul>
  </section>
);

export default Program;
